{
	"version": "https://jsonfeed.org/version/1",
	"title": "Roel Willems",
	"home_page_url": "http://roelwillems.com/",
	"feed_url": "http://roelwillems.com/feed.json",
	"items": [
		
		{
			"id": "http://roelwillems.micro.blog/2018/05/03/looking-in-to.html",
	      	
			"content_html": "<p>Looking in to switching (back) to Linux. It would be fine (or better) for 90% of my current laptop usage. Although I am still hestitant because I’m quite tied in to Apples Ecosystem at the moment  and am still looking for good alternatives for specific software</p>\n",
			"date_published": "2018-05-03T22:08:11+02:00",
			"url": "http://roelwillems.com/2018/05/03/looking-in-to.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/05/02/disruptive-vs-sustaining.html",
	      	
			"title": "Disruptive vs Sustaining innovation and the Tesla case",
			
			"content_html": "<p>I always enjoy Ben en James talking business strategy in their <a href=\"http://exponent.fm\">Exponent podcast</a> (Ben Thompson from <a href=\"https://stratechery.com\">Stratechery</a> with co-host James Allworth). Their last podcast about Zillow (<a href=\"http://exponent.fm/episode-149-zillow-and-sustaining-aggregation/\">#149 - Zillow and Sustaining Aggregation</a>) has a specific part really standing out. At 14:14 minutes in, James explains the difference between sustaining and disrupting innovation. And does so in very clear language.</p>\n\n<p>An excerpt from the podcast (emphasis is mine):</p>\n<blockquote>\n  <p>James: It think what would be interesting here, just to drive home the point for people. Is to think about a technology right now and how it could be applied as a sustaining innovation and a disruptive innovation. It’s been a less popular topic in the more recent Exponents but obviously, if you go back far enough, something we would talk a whole lot about is self-driving cars and the impact that’s going to have on society.</p>\n\n  <p>Now the technology is going to be the same if you are an existing manufacturer or something like Google, and maybe Google drops it into an existing manufacturer. This is a technology in and of itself business model agnostic, but you think about the incentives of different players and how they want to apply that technology. You give this to someone like BMW, an existing car manufacturer. And their instinct is to think; how can I take this technology and sell the vehicle that I have for more money as a result. And you get cool features like self-driving on Tesla or adaptive cruise control on BMW. <em>………</em> But it’s fundamentally a sustaining innovation. This is exactly why self-driving vehicle; people love to talk about Tesla’s disruptive, and maybe there is something in terms of the way they are thinking about building out a network and so on, this is true. But in terms of the actual vehicles, this is why Tesla vehicles are fundamentally not a disruptive product. <em>They are using a technology to sell a better product to the existing people for more money. It is fundamentally the same business model.</em> But take that to a very different context which is; <em>something like Uber or Lift, doing ride sharing. And their primary cost of business is paying for the drivers in the vehicles. And that is disruptive to the existing car manufacturers. Uber and lift want to take the self-driving technology and they are not going to take that and trying to sell the vehicles for more money as a result of it.</em> They are going to take the technology and use it to drive down the cost basis of offering ride sharing. <em>The same technology applied in fundamentally different ways, one is sustaining, one is disruptive.</em></p>\n</blockquote>\n\n<p>Highly recommend listing if you care about online/tech business strategy. \nJames (and Ben) make a very compelling case that most (new) tech companies still running sustaining business models and most of them are in fact are no disrupters at all. Even if popular media will consistently describe them as “disruptive”.</p>\n\n<p>Tesla is also a great explanatory case for disruption vs sustaining business models. The technology deployed by Tesla is very new (and Eldon’s vision maybe futuristic) but in its basic form, Tesla tries to build (better) cars and sell them for profit.</p>\n\n<p>My personal take out is: technology in and on itself isn’t disruptive, the way technology is applied and to be more precise; the business model around it, make it disruptive for the status quo. \nBased on the business model behind technology/innovation can make it sustaining or disruptive.</p>\n\n<p>I also like the Tesla example. It shows the difficulty faced when entering a market with new technology/innovation deployed in a sustainable manner. Tesla isn’t a tech company or disrupting the market. They are a car manufacturer in competition with other car manufacturers.</p>\n\n<p>And as much as I like Tesla for what they did for electric driving<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup>, I do see many challenges in keeping ahead of the competition while solving the scalability issues they are facing.</p>\n\n<p>Entering a market with a sustainable innovation is a rat race. And this is no different for Tesla.\nSo how much time does it take Tesla to get their production efficiency on par with the traditional car manufactures? And how long will it take those manufactures to get to the same technology level?</p>\n\n<p><em>Keeping in mind that traditional manufacturers very likely will be able to buy their way into newer and better technology at an increasing pace. Taking into account that there are a growing number of potential suppliers for self-driving tech (who haven’t shown interest in mass producing cars)</em>.</p>\n\n<p>With every minute passing it will be easier for those traditional manufacturers to add more advanced technology into the already established line up of cars (which already are built at a massive scale).</p>\n\n<p>So the biggest problem faced by Tesla isn’t how to build cars at scale. Given enough time I’m sure they will figure this out, other companies already have done so.</p>\n\n<p>But the challenge for Tesla is keeping their edge over the competition. Keep outpacing other car manufacturers on a technology front long enough. Making the most innovative cars and reaching the hearts&amp;minds (and share of wallets) from their potential customer. Which in turn will buy them (much needed) time to sort out car production at scale.</p>\n\n<p>And if Tesla succeeds I still wonder what will differentiate Tesla when the rest of the market obtains the same level of technology.</p>\n\n<p>You are basically betting on your ability to innovate at a faster pace then the incumbents can play catch up when competing on technology in a sustaining business model.</p>\n\n<p>Which is all well and good, but clearly very different from disruption. \nSelf-driving technology will make ride-sharing services cheap, practical and maybe even irresistible to consumers that they (potentially) will just stop buying cars altogether. Which would be very disruptive to the current market.</p>\n\n<p>If this will happen at all, no one can tell. But I know that although innovative we shouldn’t be calling Tesla disruptive anymore.</p>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:1\">\n      <p>how, in my opinion, Tesla altered the course of electric cars will be a topic for a different post <a href=\"#fnref:1\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
			"date_published": "2018-05-02T21:57:02+02:00",
			"url": "http://roelwillems.com/2018/05/02/disruptive-vs-sustaining.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/05/01/just-finished-moving.html",
	      	
			"content_html": "<p>Just finished moving some old photos from instagram to my dedicated photo-micro-blog <a href=\"http://maintainingfocus.com\">maintainingfocus.com</a>. Done for today, moving content to my own space on the web.</p>\n",
			"date_published": "2018-05-01T22:21:27+02:00",
			"url": "http://roelwillems.com/2018/05/01/just-finished-moving.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/30/by-the-way.html",
	      	
			"content_html": "<blockquote>\n  <p>By the way, here is an important lesson about delegation: remember that everyone else is also most productive when they’re doing what they like, and do what you’d want other people to do for you—try to figure out who likes (and is good at) doing what, and delegate that way.</p>\n</blockquote>\n\n<p><a href=\"http://blog.samaltman.com/productivity\">∞</a></p>\n\n<p>Good advice<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup></p>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:1\">\n      <p><em>although from “PHYSICAL FACTORS” onwards it gets a bit over the top for my taste</em> I would sum up my strategy on this topic as: exercise, eat and sleep well and take time to unwind and relax a bit. <a href=\"#fnref:1\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
			"date_published": "2018-04-30T20:16:47+02:00",
			"url": "http://roelwillems.com/2018/04/30/by-the-way.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/30/174249.html",
	      	
			"content_html": "<p><img src=\"https://f000.backblazeb2.com/file/Roel-Share/maratoncent-chall-2018-web.png\" alt=\"Concept2 Marathon challenge\" /></p>\n\n<p><a href=\"https://log.concept2.com/challenges/marathon\">Challenge</a> accepted</p>\n",
			"date_published": "2018-04-30T19:42:49+02:00",
			"url": "http://roelwillems.com/2018/04/30/174249.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/26/httpsdshreethe-joys-of.html",
	      	
			"content_html": "<p><img src=\"https://dsh.re/9e2704\" alt=\"\" /></p>\n\n<p>The joys of technology: That moment when your TV asks you for GDPR consent.</p>\n",
			"date_published": "2018-04-26T10:25:16+02:00",
			"url": "http://roelwillems.com/2018/04/26/httpsdshreethe-joys-of.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/25/on-turn-off.html",
	      	
			"title": "On turning off unnecessary notifications",
			
			"content_html": "<blockquote>\n  <ul>\n    <li>turn off all lock screen notifications (this is better for privacy anyway)</li>\n    <li>turn off vibrate and sound notifications, I leave badges for important things like messaging apps</li>\n    <li>turn off notifications for apps that really don’t need it</li>\n  </ul>\n</blockquote>\n\n<p>Nathan Toups makes a case for a <a href=\"https://nomasters.io/posts/dumber-phone/\">dumber phone</a> with great recommendations overall.</p>\n\n<p>One thing I would add from personal experience<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup> is to make very conscious use of the silence/mute switch on phone.</p>\n\n<p>No sound/viberation 99% of the time, but if I need and enable sound I also have the super annoying keyboard sounds enabled by default (so I don’t forget to revert to silent <em>ASAP</em>).</p>\n\n<p>Via <a href=\"https://brooksreview.net/2018/04/dumber-phone/\">Ben Brooks</a></p>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:1\">\n      <p>Personally I turned off sounds and vibration on my phone when I started wearing my Apple Watch.  Now I’m back to wearing a classic watch as wrist based notifications <a href=\"http://roelwillems.com/2018/04/10/the-battery-of.html\">over time became an unwanted distraction</a>. <a href=\"#fnref:1\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
			"date_published": "2018-04-25T22:56:04+02:00",
			"url": "http://roelwillems.com/2018/04/25/on-turn-off.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/25/this-will-be.html",
	      	
			"title": "This will be interesting..",
			
			"content_html": "<blockquote>\n  <p><a href=\"https://www.engadget.com/2018/04/24/whatsapp-require-users-in-europe-at-least-16-years-old/\">WhatsApp will require users in Europe to be at least 16 years old</a></p>\n</blockquote>\n\n<p>I can imagine many reasons why the age limit would need to be increased under more strict European privacy law, none of them any good for something so fundamental as a messaging app.</p>\n\n<p><em>just a recommendation: <a href=\"https://signal.org\">Signal</a> or <a href=\"https://keybase.io\">Keybase</a></em></p>\n",
			"date_published": "2018-04-25T16:09:05+02:00",
			"url": "http://roelwillems.com/2018/04/25/this-will-be.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/24/blocker-will-be.html",
	      	
			"content_html": "<p>1Blocker will be releasing a new version called <a href=\"https://backstage.1blocker.com/say-hello-to-1blocker-x-8b55efe1ae36\">1Blocker X</a> on 26 April, <a href=\"https://itunes.apple.com/us/app/id1365531024?at=1l3v36d\">pre-order now available</a>. I have no doubt it will be even better than the original (now called 1Blocker Legacy), so I’m in.</p>\n",
			"date_published": "2018-04-24T17:26:42+02:00",
			"url": "http://roelwillems.com/2018/04/24/blocker-will-be.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/23/unread-will-no.html",
	      	
			"content_html": "<blockquote>\n  <p>Unread will no longer show “Untitled” or placeholder text from syncing services when displaying posts without titles…</p>\n</blockquote>\n\n<p><img src=\"https://dsh.re/c19a2\" alt=\"Unread adds support for untitled articles\" /></p>\n\n<p>Less is more</p>\n\n<p><em>Source: <a href=\"https://burk.io/2018/04/23/this-should-be.html\">burk.io</a></em></p>\n",
			"date_published": "2018-04-23T22:15:30+02:00",
			"url": "http://roelwillems.com/2018/04/23/unread-will-no.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/23/collected-goodness-good.html",
	      	
			"title": "∞ Collected Goodness Good material. Good art. Good living.",
			
			"content_html": "<p><a href=\"https://collectedgoodness.com/\">Collected Goodness.com</a> by <a href=\"http://www.coffman.co/\">Drew Coffman</a></p>\n\n<p>Very interesting and inspiring stuff, will need to look in to it more but the first recommended reads/listens seem very worthwhile.</p>\n\n<p>I also like the format a lot, it strikes a balance between linking to interesting content supplemented with quotes supported by the voice-over by Drew.  Very well done altogether.</p>\n\n<p><em>Found via: <a href=\"https://micro.blog/patrickrhone\">@patrickrhone</a> (thanks!)</em></p>\n",
			"date_published": "2018-04-23T17:33:49+02:00",
			"url": "http://roelwillems.com/2018/04/23/collected-goodness-good.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/18/223427.html",
	      	
			"content_html": "<p><img src=\"https://f000.backblazeb2.com/file/Roel-Share/Screen-Shot-2018-04-19-00-31-18.png\" alt=\"Night Owl \" /></p>\n\n<p>Unlock the Night Owl pin, time to sign off</p>\n",
			"date_published": "2018-04-19T00:34:27+02:00",
			"url": "http://roelwillems.com/2018/04/19/223427.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/18/scaling-is-hard.html",
	      	
			"title": "Scaling is hard",
			
			"content_html": "<blockquote>\n  <p>Most of the design tolerances of the Model 3 are already better than any other car in the world. Soon, they will all be better. This is not enough. We will keep going until the Model 3 build precision is a factor of ten better than any other car in the world. I am not kidding.</p>\n\n  <p>Our car needs to be designed and built with such accuracy and precision that, if an owner measures dimensions, panel gaps and flushness, and their measurements don’t match the Model 3 specs, it just means that their measuring tape is wrong.</p>\n</blockquote>\n\n<p>I’m <a href=\"https://daringfireball.net/linked/2018/04/17/musk-tesla\">quoting a quote of Eldon Musk by John Gruber</a>.</p>\n\n<p>But after reading the article and memo I can’t suppress the feeling that people waiting in line (after forking over cash to enter the cue) would be happy with clear delivery times<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup> and quite satisfied with tolerances on par with current electric cars that are already build at scale<sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote\">2</a></sup>.</p>\n\n<p>In my opinion the real challenge for Tesla (or any car manufacture for that matter) isn’t reaching near perfect build precision but getting to a good enough level <em>at scale</em>.</p>\n\n<p>Tesla taking on the challenge to build 350.000+ model 3’s currently in backorder<sup id=\"fnref:3\"><a href=\"#fn:3\" class=\"footnote\">3</a></sup> is a marvel on it’s own.</p>\n\n<p>This will play out to be the greatest achievement in automotive history or Tesla being overtaken by the <a href=\"https://www.wsj.com/articles/volvo-to-phase-out-conventional-car-engine-14992272020\">traditional manufactures moving to full electric</a>.</p>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:1\">\n      <p><a href=\"https://www.telegraph.co.uk/technology/2018/04/17/tesla-halts-model-3-production-second-time-year/amp/\">Tesla halts Model 3 production second time this year -telegraph.co.uk</a> <a href=\"#fnref:1\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:2\">\n      <p>In Europe you could have a full electric VW e-Golf on your driveway, two months after you place an order. <a href=\"#fnref:2\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:3\">\n      <p>Based on quick calculation on numbers provided by <a href=\"https://www.bloomberg.com/news/articles/2018-04-18/california-opens-investigation-into-tesla-workplace-conditions\">Bloomberg</a> <a href=\"#fnref:3\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
			"date_published": "2018-04-19T00:29:54+02:00",
			"url": "http://roelwillems.com/2018/04/19/scaling-is-hard.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/18/far-more-than.html",
	      	
			"content_html": "<blockquote>\n  <p>Far more than 87 million people may have had their Facebook data harvested by Cambridge Analytica</p>\n</blockquote>\n\n<p>No surprises here, but I am still curious what the final number will be. Place your bets…</p>\n",
			"date_published": "2018-04-18T22:17:54+02:00",
			"url": "http://roelwillems.com/2018/04/18/far-more-than.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/18/today-ive-switched.html",
	      	
			"content_html": "<p>Today I’ve switched RSS service.  After Greader, quite some time long self-hosted (<a href=\"https://feedafever.com/\">Fever</a> <sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup>) using minimalreader.com<sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote\">2</a></sup>. Today I settled on <a href=\"https://feedbin.com/\">Feedbin</a>, good web interface, support for third party apps/syncing and a clear business model.</p>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:1\">\n      <p>not in active development <a href=\"#fnref:1\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:2\">\n      <p>discontinued <a href=\"#fnref:2\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
			"date_published": "2018-04-18T21:45:40+02:00",
			"url": "http://roelwillems.com/2018/04/18/today-ive-switched.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/17/its-all-about.html",
	      	
			"title": "∞ It’s all about perspective",
			
			"content_html": "<blockquote>\n  <p>Mobile apps are still often lacking in efficiency, Apple’s Smart Keyboard is mediocre and reaching up to touch the screen is far less comfortable and efficient than using a mouse.</p>\n</blockquote>\n\n<p><a href=\"https://www.engadget.com/2018/04/12/ipad-laptop-replacement/\">engadget.com</a></p>\n\n<p>The whole article feels a bit shortsighted and only focussing on comparing the iPad to a regular PC. All of the statements could be made in favour of the iPad as a PC replacement. It’s all about perspective I guess.</p>\n",
			"date_published": "2018-04-17T23:18:33+02:00",
			"url": "http://roelwillems.com/2018/04/17/its-all-about.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/16/micro-guide-additional.html",
	      	
			"title": "Micro guide: Additional steps and recommendations when using Cloudflare for your DNS",
			
			"content_html": "<p><a href=\"https://www.cloudflare.com/\">Cloudflare</a> users wanting to use a custom domain name for their hosted Micro.blog will be greeted by a <code class=\"highlighter-rouge\">“custom domain isn't pointing to the micro.blog\"</code> error message when trying to save the custom domain.</p>\n\n<p>Luckily there is a work around:</p>\n\n<h2 id=\"how-to-get-your-custom-domain-working-with-cloudflare\">How to get your custom domain working <em>with</em> Cloudflare</h2>\n<ol>\n  <li>First follow the steps as outlined above and add the proper “A” and/or “CNAME” records to the Cloudflare DNS panel;</li>\n  <li>Before adding the custom domain to your Micro.blog account make sure that the “DNS and HTTP proxy (CDN)”  (orange cloud-icon) is disabled and set to bypass (grey cloud icon with the hover text “DNS only”);</li>\n  <li>After updating your DNS records and Cloudflare set to bypass for the “A” record and/or “CNAME” go to “Account” on Micro.blog  and fill hostname (e.g. yourdomain.com) that you’d like to use for your Micro.blog;</li>\n  <li>Micro.blog should save and enable to custom domain without issues. <em>If you get a message “custom domain isn’t pointing to the micro.blog”</em> make sure that you have set Cloudflare on bypass and wait for a few more minutes (the DNS change can take some time to get in effect);</li>\n  <li>After successful saving the custom domain you can re-enable Cloudflare functionality on your domain/Micro.blog by remove the bypass, make sure that the cloud-icon is set to orange (hover text should state: “DNS and HTTP proxy (CDN)”).</li>\n</ol>\n\n<p><em>So there you have it, you are able to use  Cloudflare (DNS/CDN/security/caching/DDOS protection) with hosted Micro.blogs, with some  additional steps to get the initial setup working.</em></p>\n\n<h2 id=\"some-additional-recommendations\">Some additional recommendations:</h2>\n\n<h3 id=\"using-cloudflare-to-redirect-www-to-root-domain\">Using Cloudflare to redirect www. to root domain</h3>\n<p>If you would like to enable www. and root version of your custom domain it’s advisable to redirect one to the other (to make sure that there isn’t any duplicated content). Cloudflare can redirect the www. version to the root domain:</p>\n<ol>\n  <li>Go to “Page rules” within your Cloudflare account;</li>\n  <li>Create a page rule;</li>\n  <li>Add &lt;www.yourdomain.com&gt;/* within the first field (“If the URL matches”);</li>\n  <li>Under “Then the settings are:” select “Forwarding URL”, “ 301 - Permanent redirect”;</li>\n  <li>Add: &lt;yourdomain.com&gt;/$1 to the destination URL field;</li>\n  <li>Save and deploy the page rule for the redirect to take effect.</li>\n</ol>\n\n<h3 id=\"cloudflare-ssl-and-your-microblog\">Cloudflare, SSL and your Micro.blog</h3>\n<p>You should not use the SSL functionality provided by Cloudflare (email help@micro.blog to enable SSL).</p>\n",
			"date_published": "2018-04-16T22:19:43+02:00",
			"url": "http://roelwillems.com/2018/04/16/micro-guide-additional.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/16/micro-guides-small.html",
	      	
			"title": "Micro Guides: small articles which can be of great help",
			
			"content_html": "<p>Yesterday I had the opportunity to help someone from the <a href=\"https://micro.blog\">Micro.blog</a> community by writing a <a href=\"http://roelwillems.com/2018/04/15/i-switched-my.html\">tiny post</a>.</p>\n\n<p>This sparked an idea: <em>Micro guides</em>, small articles about any subject you think could be of help or interest to the Microblogging community (for instance on writing, podcasting<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup>, blog design or any other subject you think could be of help).</p>\n\n<p>I will certainly start to share more short articles on my journey to writing more often and possibly on Micro.blog tech stuff if I run in to it.</p>\n\n<p>The open web is build together, feel free to share (who knows how many people you could help!)</p>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:1\">\n      <p>I already learned a lot about podcasting from the people I follow. <a href=\"#fnref:1\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
			"date_published": "2018-04-16T21:52:38+02:00",
			"url": "http://roelwillems.com/2018/04/16/micro-guides-small.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/15/i-switched-my.html",
	      	
			"title": "Micro Guide: Changing the default colors of the Micro.blog Marfa theme",
			
			"content_html": "<p>I switched my theme for this microblog to Marfa.</p>\n\n<p>Marfa is a new theme for <a href=\"https://micro.blog\">Micro.blog</a> hosted websites. I really like the theme but wanted to give it a small personal touch by changing the default color for links.</p>\n\n<p>Changing the defaults (light red/pink-ish) is quite easy. \nUsing the edit CSS functionality of Micro.blog you can overwrite the default colors by pasting the code above and change the colors to your liking.</p>\n\n<pre><code class=\"language-CSS\">nav.main-nav a.cta {\n\tbackground: #fff;\n\tcolor: #ee4792;\n\tborder: 2px solid #fcdae9;\n}\n\nnav.main-nav a.cta:hover {\n\tbackground: #fcdae9;\n\tcolor: #ee4792;\n}\n\nnav.main-nav a, #footer a, #post-nav a, p a{\n   box-shadow: inset 0 -2px 0 #fcdae9;\n}\n\nnav.main-nav a:hover, #footer a:hover, #post-nav a:hover, p a:hover {\n\tbox-shadow: inset 0 -25px 0 #fcdae9;\n}\n</code></pre>\n<p><em><code class=\"highlighter-rouge\">#fcdae9</code> is for underline and shading of the links. The <code class=\"highlighter-rouge\">#ee4792</code> color is for the “Also on Micro.blog” text in the upper right button.</em></p>\n",
			"date_published": "2018-04-15T22:01:51+02:00",
			"url": "http://roelwillems.com/2018/04/15/i-switched-my.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/12/microcasting-short-form.html",
	      	
			"content_html": "<p>Microcasting (short form podcasting) comes to Micro.blog. Welcome <a href=\"http://www.manton.org/2018/04/wavelength-for-micro-blog.html\">Wavelength</a>. What a great addition to <a href=\"https://micro.blog/\">Micro.blog</a> and the Indieweb!</p>\n",
			"date_published": "2018-04-12T21:41:04+02:00",
			"url": "http://roelwillems.com/2018/04/12/microcasting-short-form.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/12/the-irony.html",
	      	
			"title": "The Irony",
			
			"content_html": "<p>Mark Zuckerberg left some of his notes on the table during a break in his testimony before Congress yesterday. It caught the attention of a press photographer who shared a photo of the document on social media.</p>\n\n<p>I guess Mark learned an important lesson: never to leave your notes open and unattended in public. Keeping stuff to yourself should not be based solely on trusting others to act in your best interest.</p>\n\n<p>To reuse and rephrase a <a href=\"http://www.businessinsider.com/well-these-new-zuckerberg-ims-wont-help-facebooks-privacy-problems-2010-5?international=true&amp;r=US&amp;IR=T\">quote by Mr. Zuckerberg himself</a>; <em>‘I’ve “trust them.” Dumb f*ck’</em></p>\n\n<p>There is, however, quite some talk on social media if it’s morally ok for the press to share the picture taken.  A valid discussion even when it’s a hearing regarding a company under testimony for violating people’s privacy. We should treat others as you would want them to treat you<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup>.</p>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:1\">\n      <p>I’m not linking to the photo as I think this information should have been kept private. The company in question doesn’t change this for me. <a href=\"#fnref:1\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
			"date_published": "2018-04-12T18:11:59+02:00",
			"url": "http://roelwillems.com/2018/04/12/the-irony.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/11/do-i-really.html",
	      	
			"title": "Do I really need to switch Text Editors?",
			
			"content_html": "<p>Questioning if I really need to look in to switching Text editors I almost discarding the <a href=\"https://thesweetsetup.com/apps/best-text-editor-macos/\">pick for the best Text Editor over at The Sweet Setup</a>. Although after quickly skimming the article, some part did caught my attention.</p>\n\n<blockquote>\n  <p>Atom, being open source, has an advantage here compared to other options like Sublime Text or BBEdit.</p>\n\n  <p>Even if GitHub were to stop actively developing Atom, the open source nature of the app would (probably) allow it to live on through collaboration of its users and other contributors. In that sense, Atom is about as future-proof as an app can be.</p>\n</blockquote>\n\n<p>Being open source and supported by a community sparked my interest (mainly due to my renewed focus on IndieWeb / Open standards and Open source). So, a bit to my surprise, I am now switching text editors.</p>\n\n<p><img src=\"http://roelwillems.com/uploads/2018/dc5525c2df.jpg\" width=\"600\" height=\"400\" /></p>\n",
			"date_published": "2018-04-11T21:58:18+02:00",
			"url": "http://roelwillems.com/2018/04/11/do-i-really.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/10/the-death-of.html",
	      	
			"content_html": "<p>Benedict Evans in his article “The death of the newsfeed” very clearly provides insight on why big tech companies are forced to a more algorithmic world, inadvertently forcing them between a rock and a hard place.</p>\n\n<p>I couldn’t agree more to all Benedict states in this article and highly recommend anyone interested in this subject to read the article (twice!).</p>\n\n<blockquote>\n  <p>Unavoidable as it seems, though, this approach has two problems. First, getting that sample ‘right’ is very hard, and beset by all sorts of conceptual challenges. But second, even if it’s a successful sample, it’s still a sample.</p>\n\n  <p>Using signals of what people seem to want to see risks over-fitting, circularity and filter bubbles. People’s desires change, and they get bored of things.</p>\n</blockquote>\n\n<p>In my opinion this is one of the biggest challenges in data science.</p>\n\n<p>How can we help people navigate an abundance of choices (post, pictures,  search results or products) without unethically steer behaviour, creating self-fulfilling prophecy<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup> or limit the room for people to change their preferences and discover new stuff.</p>\n\n<p><a href=\"https://www.ben-evans.com/benedictevans/2018/4/2/the-death-of-the-newsfeed\">The death of the newsfeed - Benedict Evans</a></p>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:1\">\n      <p>Eli Pariser - Beware online “filter bubble”: <a href=\"https://www.ted.com/talks/eli_pariser_beware_online_filter_bubbles\">TED talk</a> <a href=\"#fnref:1\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
			"date_published": "2018-04-10T22:03:19+02:00",
			"url": "http://roelwillems.com/2018/04/10/the-death-of.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/10/the-battery-of.html",
	      	
			"content_html": "<p>The battery of my Apple Watch(v1) really starts showing it’s age. After being on my wrist daily for years, I don’t know if I will get another one… Having a completely muted iPhone is great but wrist based notification are still a major distraction during one-on-one conversations.</p>\n",
			"date_published": "2018-04-10T20:41:39+02:00",
			"url": "http://roelwillems.com/2018/04/10/the-battery-of.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/09/obscure-email-vulnerability.html",
	      	
			"title": "∞ Obscure E-Mail Vulnerability",
			
			"content_html": "<blockquote>\n  <p>This vulnerability is a result of an interaction between two different ways of handling e-mail addresses. Gmail ignores dots … Netflix doesn’t ignore dots.</p>\n\n  <p>It’s an example of two systems without a security vulnerability coming together to create a security vulnerability. As we connect more systems directly to each other, we’re going to see a lot more of these.</p>\n</blockquote>\n\n<p><a href=\"https://www.schneier.com/blog/archives/2018/04/obscure_e-mail_.html\">Obscure E-Mail Vulnerability - Schneier on Security</a></p>\n",
			"date_published": "2018-04-09T22:44:44+02:00",
			"url": "http://roelwillems.com/2018/04/09/obscure-email-vulnerability.html"
		}
		
	]
}
