{
	"version": "https://jsonfeed.org/version/1",
	"title": "Roel Willems",
	"home_page_url": "http://roelwillems.com/",
	"feed_url": "http://roelwillems.com/feed.json",
	"items": [
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/18/far-more-than.html",
	      	
			"content_html": "<blockquote>\n  <p>Far more than 87 million people may have had their Facebook data harvested by Cambridge Analytica</p>\n</blockquote>\n\n<p>No surprises here, but I am still curious what the final number will be. Place your bets…</p>\n",
			"date_published": "2018-04-18T22:17:54+02:00",
			"url": "http://roelwillems.com/2018/04/18/far-more-than.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/18/today-ive-switched.html",
	      	
			"content_html": "<p>Today I’ve switched RSS service.  After Greader, quite some time long self-hosted (<a href=\"https://feedafever.com/\">Fever</a> <sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup>) using minimalreader.com<sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote\">2</a></sup>. Today I settled on <a href=\"https://feedbin.com/\">Feedbin</a>, good web interface, support for third party apps/syncing and a clear business model.</p>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:1\">\n      <p>not in active development <a href=\"#fnref:1\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:2\">\n      <p>discontinued <a href=\"#fnref:2\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
			"date_published": "2018-04-18T21:45:40+02:00",
			"url": "http://roelwillems.com/2018/04/18/today-ive-switched.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/17/its-all-about.html",
	      	
			"title": "∞ It’s all about perspective",
			
			"content_html": "<blockquote>\n  <p>Mobile apps are still often lacking in efficiency, Apple’s Smart Keyboard is mediocre and reaching up to touch the screen is far less comfortable and efficient than using a mouse.</p>\n</blockquote>\n\n<p><a href=\"https://www.engadget.com/2018/04/12/ipad-laptop-replacement/\">engadget.com</a></p>\n\n<p>The whole article feels a bit shortsighted and only focussing on comparing the iPad to a regular PC. All of the statements could be made in favour of the iPad as a PC replacement. It’s all about perspective I guess.</p>\n",
			"date_published": "2018-04-17T23:18:33+02:00",
			"url": "http://roelwillems.com/2018/04/17/its-all-about.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/16/micro-guide-additional.html",
	      	
			"title": "Micro guide: Additional steps and recommendations when using Cloudflare for your DNS",
			
			"content_html": "<p><a href=\"https://www.cloudflare.com/\">Cloudflare</a> users wanting to use a custom domain name for their hosted Micro.blog will be greeted by a <code class=\"highlighter-rouge\">“custom domain isn't pointing to the micro.blog\"</code> error message when trying to save the custom domain.</p>\n\n<p>Luckily there is a work around:</p>\n\n<h2 id=\"how-to-get-your-custom-domain-working-with-cloudflare\">How to get your custom domain working <em>with</em> Cloudflare</h2>\n<ol>\n  <li>First follow the steps as outlined above and add the proper “A” and/or “CNAME” records to the Cloudflare DNS panel;</li>\n  <li>Before adding the custom domain to your Micro.blog account make sure that the “DNS and HTTP proxy (CDN)”  (orange cloud-icon) is disabled and set to bypass (grey cloud icon with the hover text “DNS only”);</li>\n  <li>After updating your DNS records and Cloudflare set to bypass for the “A” record and/or “CNAME” go to “Account” on Micro.blog  and fill hostname (e.g. yourdomain.com) that you’d like to use for your Micro.blog;</li>\n  <li>Micro.blog should save and enable to custom domain without issues. <em>If you get a message “custom domain isn’t pointing to the micro.blog”</em> make sure that you have set Cloudflare on bypass and wait for a few more minutes (the DNS change can take some time to get in effect);</li>\n  <li>After successful saving the custom domain you can re-enable Cloudflare functionality on your domain/Micro.blog by remove the bypass, make sure that the cloud-icon is set to orange (hover text should state: “DNS and HTTP proxy (CDN)”).</li>\n</ol>\n\n<p><em>So there you have it, you are able to use  Cloudflare (DNS/CDN/security/caching/DDOS protection) with hosted Micro.blogs, with some  additional steps to get the initial setup working.</em></p>\n\n<h2 id=\"some-additional-recommendations\">Some additional recommendations:</h2>\n\n<h3 id=\"using-cloudflare-to-redirect-www-to-root-domain\">Using Cloudflare to redirect www. to root domain</h3>\n<p>If you would like to enable www. and root version of your custom domain it’s advisable to redirect one to the other (to make sure that there isn’t any duplicated content). Cloudflare can redirect the www. version to the root domain:</p>\n<ol>\n  <li>Go to “Page rules” within your Cloudflare account;</li>\n  <li>Create a page rule;</li>\n  <li>Add &lt;www.yourdomain.com&gt;/* within the first field (“If the URL matches”);</li>\n  <li>Under “Then the settings are:” select “Forwarding URL”, “ 301 - Permanent redirect”;</li>\n  <li>Add: &lt;yourdomain.com&gt;/$1 to the destination URL field;</li>\n  <li>Save and deploy the page rule for the redirect to take effect.</li>\n</ol>\n\n<h3 id=\"cloudflare-ssl-and-your-microblog\">Cloudflare, SSL and your Micro.blog</h3>\n<p>You should not use the SSL functionality provided by Cloudflare (email help@micro.blog to enable SSL).</p>\n",
			"date_published": "2018-04-16T22:19:43+02:00",
			"url": "http://roelwillems.com/2018/04/16/micro-guide-additional.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/16/micro-guides-small.html",
	      	
			"title": "Micro Guides: small articles which can be of great help",
			
			"content_html": "<p>Yesterday I had the opportunity to help someone from the <a href=\"https://micro.blog\">Micro.blog</a> community by writing a <a href=\"http://roelwillems.com/2018/04/15/i-switched-my.html\">tiny post</a>.</p>\n\n<p>This sparked an idea: <em>Micro guides</em>, small articles about any subject you think could be of help or interest to the Microblogging community (for instance on writing, podcasting<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup>, blog design or any other subject you think could be of help).</p>\n\n<p>I will certainly start to share more short articles on my journey to writing more often and possibly on Micro.blog tech stuff if I run in to it.</p>\n\n<p>The open web is build together, feel free to share (who knows how many people you could help!)</p>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:1\">\n      <p>I already learned a lot about podcasting from the people I follow. <a href=\"#fnref:1\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
			"date_published": "2018-04-16T21:52:38+02:00",
			"url": "http://roelwillems.com/2018/04/16/micro-guides-small.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/15/i-switched-my.html",
	      	
			"title": "Micro Guide: Changing the default colors of the Micro.blog Marfa theme",
			
			"content_html": "<p>I switched my theme for this microblog to Marfa.</p>\n\n<p>Marfa is a new theme for <a href=\"https://micro.blog\">Micro.blog</a> hosted websites. I really like the theme but wanted to give it a small personal touch by changing the default color for links.</p>\n\n<p>Changing the defaults (light red/pink-ish) is quite easy. \nUsing the edit CSS functionality of Micro.blog you can overwrite the default colors by pasting the code above and change the colors to your liking.</p>\n\n<pre><code class=\"language-CSS\">nav.main-nav a.cta {\n\tbackground: #fff;\n\tcolor: #ee4792;\n\tborder: 2px solid #fcdae9;\n}\n\nnav.main-nav a.cta:hover {\n\tbackground: #fcdae9;\n\tcolor: #ee4792;\n}\n\nnav.main-nav a, #footer a, #post-nav a, p a{\n   box-shadow: inset 0 -2px 0 #fcdae9;\n}\n\nnav.main-nav a:hover, #footer a:hover, #post-nav a:hover, p a:hover {\n\tbox-shadow: inset 0 -25px 0 #fcdae9;\n}\n</code></pre>\n<p><em><code class=\"highlighter-rouge\">#fcdae9</code> is for underline and shading of the links. The <code class=\"highlighter-rouge\">#ee4792</code> color is for the “Also on Micro.blog” text in the upper right button.</em></p>\n",
			"date_published": "2018-04-15T22:01:51+02:00",
			"url": "http://roelwillems.com/2018/04/15/i-switched-my.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/12/microcasting-short-form.html",
	      	
			"content_html": "<p>Microcasting (short form podcasting) comes to Micro.blog. Welcome <a href=\"http://www.manton.org/2018/04/wavelength-for-micro-blog.html\">Wavelength</a>. What a great addition to <a href=\"https://micro.blog/\">Micro.blog</a> and the Indieweb!</p>\n",
			"date_published": "2018-04-12T21:41:04+02:00",
			"url": "http://roelwillems.com/2018/04/12/microcasting-short-form.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/12/the-irony.html",
	      	
			"title": "The Irony",
			
			"content_html": "<p>Mark Zuckerberg left some of his notes on the table during a break in his testimony before Congress yesterday. It caught the attention of a press photographer who shared a photo of the document on social media.</p>\n\n<p>I guess Mark learned an important lesson: never to leave your notes open and unattended in public. Keeping stuff to yourself should not be based solely on trusting others to act in your best interest.</p>\n\n<p>To reuse and rephrase a <a href=\"http://www.businessinsider.com/well-these-new-zuckerberg-ims-wont-help-facebooks-privacy-problems-2010-5?international=true&amp;r=US&amp;IR=T\">quote by Mr. Zuckerberg himself</a>; <em>‘I’ve “trust them.” Dumb f*ck’</em></p>\n\n<p>There is, however, quite some talk on social media if it’s morally ok for the press to share the picture taken.  A valid discussion even when it’s a hearing regarding a company under testimony for violating people’s privacy. We should treat others as you would want them to treat you<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup>.</p>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:1\">\n      <p>I’m not linking to the photo as I think this information should have been kept private. The company in question doesn’t change this for me. <a href=\"#fnref:1\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
			"date_published": "2018-04-12T18:11:59+02:00",
			"url": "http://roelwillems.com/2018/04/12/the-irony.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/11/do-i-really.html",
	      	
			"title": "Do I really need to switch Text Editors?",
			
			"content_html": "<p>Questioning if I really need to look in to switching Text editors I almost discarding the <a href=\"https://thesweetsetup.com/apps/best-text-editor-macos/\">pick for the best Text Editor over at The Sweet Setup</a>. Although after quickly skimming the article, some part did caught my attention.</p>\n\n<blockquote>\n  <p>Atom, being open source, has an advantage here compared to other options like Sublime Text or BBEdit.</p>\n\n  <p>Even if GitHub were to stop actively developing Atom, the open source nature of the app would (probably) allow it to live on through collaboration of its users and other contributors. In that sense, Atom is about as future-proof as an app can be.</p>\n</blockquote>\n\n<p>Being open source and supported by a community sparked my interest (mainly due to my renewed focus on IndieWeb / Open standards and Open source). So, a bit to my surprise, I am now switching text editors.</p>\n\n<p><img src=\"http://roelwillems.com/uploads/2018/dc5525c2df.jpg\" width=\"600\" height=\"400\" /></p>\n",
			"date_published": "2018-04-11T21:58:18+02:00",
			"url": "http://roelwillems.com/2018/04/11/do-i-really.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/10/the-death-of.html",
	      	
			"content_html": "<p>Benedict Evans in his article “The death of the newsfeed” very clearly provides insight on why big tech companies are forced to a more algorithmic world, inadvertently forcing them between a rock and a hard place.</p>\n\n<p>I couldn’t agree more to all Benedict states in this article and highly recommend anyone interested in this subject to read the article (twice!).</p>\n\n<blockquote>\n  <p>Unavoidable as it seems, though, this approach has two problems. First, getting that sample ‘right’ is very hard, and beset by all sorts of conceptual challenges. But second, even if it’s a successful sample, it’s still a sample.</p>\n\n  <p>Using signals of what people seem to want to see risks over-fitting, circularity and filter bubbles. People’s desires change, and they get bored of things.</p>\n</blockquote>\n\n<p>In my opinion this is one of the biggest challenges in data science.</p>\n\n<p>How can we help people navigate an abundance of choices (post, pictures,  search results or products) without unethically steer behaviour, creating self-fulfilling prophecy<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup> or limit the room for people to change their preferences and discover new stuff.</p>\n\n<p><a href=\"https://www.ben-evans.com/benedictevans/2018/4/2/the-death-of-the-newsfeed\">The death of the newsfeed - Benedict Evans</a></p>\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:1\">\n      <p>Eli Pariser - Beware online “filter bubble”: <a href=\"https://www.ted.com/talks/eli_pariser_beware_online_filter_bubbles\">TED talk</a> <a href=\"#fnref:1\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>\n",
			"date_published": "2018-04-10T22:03:19+02:00",
			"url": "http://roelwillems.com/2018/04/10/the-death-of.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/10/the-battery-of.html",
	      	
			"content_html": "<p>The battery of my Apple Watch(v1) really starts showing it’s age. After being on my wrist daily for years, I don’t know if I will get another one… Having a completely muted iPhone is great but wrist based notification are still a major distraction during one-on-one conversations.</p>\n",
			"date_published": "2018-04-10T20:41:39+02:00",
			"url": "http://roelwillems.com/2018/04/10/the-battery-of.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/09/obscure-email-vulnerability.html",
	      	
			"title": "∞ Obscure E-Mail Vulnerability",
			
			"content_html": "<blockquote>\n  <p>This vulnerability is a result of an interaction between two different ways of handling e-mail addresses. Gmail ignores dots … Netflix doesn’t ignore dots.</p>\n\n  <p>It’s an example of two systems without a security vulnerability coming together to create a security vulnerability. As we connect more systems directly to each other, we’re going to see a lot more of these.</p>\n</blockquote>\n\n<p><a href=\"https://www.schneier.com/blog/archives/2018/04/obscure_e-mail_.html\">Obscure E-Mail Vulnerability - Schneier on Security</a></p>\n",
			"date_published": "2018-04-09T22:44:44+02:00",
			"url": "http://roelwillems.com/2018/04/09/obscure-email-vulnerability.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/09/after-writing-another.html",
	      	
			"content_html": "<p>After writing another post on Facebook and the recent privacy scandals I deleted it all; because it’s not about Facebook at all.</p>\n\n<p>It’s about alternatives (preferably which can not be “acquired”, but this is a topic for a different post) and this is exactly why moved all my writing to <a href=\"https://micro.blog\">Micro.blog</a>.</p>\n",
			"date_published": "2018-04-09T22:38:09+02:00",
			"url": "http://roelwillems.com/2018/04/09/after-writing-another.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/04/facebook-sharply-increases.html",
	      	
			"title": "∞ Facebook Sharply Increases Estimate of How Many Users’ Information Was Harvested By Cambridge Analytica",
			
			"content_html": "<blockquote>\n  <p>Facebook on Wednesday said the personal information of up to 87 million people, most of them Americans, may have been improperly shared during the 2016 election with Cambridge Analytica, a political consulting firm connected to President Trump.</p>\n</blockquote>\n\n<p><a href=\"https://www.nytimes.com/2018/04/04/technology/mark-zuckerberg-testify-congress.html\">nytimes</a></p>\n\n<p>I won’t be the least surprised if this number will still increase quit a bit in the coming weeks.</p>\n",
			"date_published": "2018-04-04T23:47:11+02:00",
			"url": "http://roelwillems.com/2018/04/04/facebook-sharply-increases.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/03/lasting-appeal-of.html",
	      	
			"title": "∞ Lasting appeal of RSS",
			
			"content_html": "<blockquote>\n  <p>Still, the lasting appeal of RSS remains the parts that haven’t changed: the unfiltered view of the open web, and the chance to make your own decisions about what you find there.</p>\n</blockquote>\n\n<p><em><a href=\"https://www.wired.com/story/rss-readers-feedly-inoreader-old-reader/\">Wired</a></em></p>\n\n<p>It’s great to see a recent uptake in RSS popularity. In my opinion RSS is one of the most valuable tools of the internet. \nAnd although probably not growing in new users for quite some time, for people still onboard, including myself, RSS never stopt providing it’s value.</p>\n\n<p>Being a open standard really proves it’s value <em>and</em> resilience.</p>\n\n<p><em>If someone is looking a basic but dependable RSS service I can recommend Feedbin.</em></p>\n",
			"date_published": "2018-04-03T23:22:14+02:00",
			"url": "http://roelwillems.com/2018/04/03/lasting-appeal-of.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/03/measure-your-success.html",
	      	
			"content_html": "<blockquote>\n  <p>“Measure your success by the success of others.” <a href=\"http://scripting.com/2018/01/09/215812.html#a220039\">Dave Winer</a></p>\n</blockquote>\n\n<p><em>Seems only natural to stumble upon a striking quote by Dave Winer browsing a micro.blog. (Dave more or less invented blogging and RSS syndication and has the longest continuously running blog on the Internet).</em></p>\n",
			"date_published": "2018-04-03T22:39:09+02:00",
			"url": "http://roelwillems.com/2018/04/03/measure-your-success.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/02/although-i-like.html",
	      	
			"title": "∞ Cloudflare launches ",
			
			"content_html": "<blockquote>\n  <p>Cloudflare’s mission is to help build a better Internet.\nWe’re excited today to take another step toward that mission with the launch of 1.1.1.1 — the Internet’s fastest, privacy-first consumer DNS service.\n…\nfor most Internet users, when they connect to an ISP, or a coffee shop wifi hot spot, or a mobile network then the network operator will dictate what DNS resolver to use.\n…\nThe problem is that these DNS services are often slow and not privacy respecting.</p>\n</blockquote>\n\n<p>Although I like Cloudflare, I’m not sure what to think regarding there recent news regarding their own <a href=\"https://blog.cloudflare.com/announcing-1111/\">DNS service</a>.</p>\n\n<p>I do think it’ great that they bring an alternative DNS service (with great performance and seemingly a strong focus on privacy). But I have some reservations regarding centralising DNS at a company which already controls 80% of the western internet.</p>\n",
			"date_published": "2018-04-02T21:49:08+02:00",
			"url": "http://roelwillems.com/2018/04/02/although-i-like.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2017/11/20/a-list-aparts.html",
	      	
			"title": "∞ A List Apart's 20th anniversary view on the centralising of the internet in to only a handful of all-powerful networks",
			
			"content_html": "<blockquote>\n  <p>“In recent years, we’ve seen our rich universe of diverse, creative blogs and sites implode—leaving fewer and fewer channels available to new voices. As more content centralizes into a handful of all-powerful networks, there’s a dreary sameness in perspective and presentation. …. This creeping monopolization is a sad echo of how media worked in the 20th century. It doesn’t reflect 21st century diversity and empowerment. It’s not the web’s promise. It’s not how it’s supposed to be.”</p>\n</blockquote>\n\n<p><a href=\"https://alistapart.com/article/new-a-list-apart-wants-you\">A list apart</a></p>\n\n<p>I couldn’t agree more to this statement. With some centralized players growing more  powerfull with each day passing, it’s more important to support diversity, independent content creation and keep ownership of your content.</p>\n",
			"date_published": "2017-11-20T21:13:33+01:00",
			"url": "http://roelwillems.com/2017/11/20/a-list-aparts.html"
		}
		
	]
}
