{
	"version": "https://jsonfeed.org/version/1",
	"title": "Roel Willems",
	"home_page_url": "http://roelwillems.com/",
	"feed_url": "http://roelwillems.com/feed.json",
	"items": [
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/03/lasting-appeal-of.html",
	      	
			"title": "Lasting appeal of RSS",
			
			"content_html": "<blockquote>\n  <p>Still, the lasting appeal of RSS remains the parts that haven’t changed: the unfiltered view of the open web, and the chance to make your own decisions about what you find there.</p>\n</blockquote>\n\n<p><em><a href=\"https://www.wired.com/story/rss-readers-feedly-inoreader-old-reader/\">Wired</a></em></p>\n\n<p>It’s great to see a recent uptake in RSS popularity. In my opinion RSS is one of the most valuable tools of the internet. \nAnd although probably not growing in new users for quite some time, for people still onboard, including myself, RSS never stopt providing it’s value.</p>\n\n<p>Being a open standard really proves it’s value <em>and</em> resilience.</p>\n\n<p><em>If someone is looking a basic but dependable RSS service I can recommend Miniflux.</em></p>\n",
			"date_published": "2018-04-03T23:22:00+02:00",
			"url": "http://roelwillems.com/2018/04/03/lasting-appeal-of.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/03/measure-your-success.html",
	      	
			"content_html": "<p>“Measure your success by the success of others.” <a href=\"http://scripting.com/2018/01/09/215812.html#a220039\">Dave Winer</a></p>\n\n<p><em>Seems only natural to stumble upon a striking quote by Dave Winer browsing a micro.blog. (Dave more or less invented blogging and RSS syndication and has the longest continuously running blog on the Internet).</em></p>\n",
			"date_published": "2018-04-03T22:39:00+02:00",
			"url": "http://roelwillems.com/2018/04/03/measure-your-success.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2018/04/02/although-i-like.html",
	      	
			"title": "Cloudflare launches ",
			
			"content_html": "<blockquote>\n  <p>Cloudflare’s mission is to help build a better Internet.\nWe’re excited today to take another step toward that mission with the launch of 1.1.1.1 — the Internet’s fastest, privacy-first consumer DNS service.\n…\nfor most Internet users, when they connect to an ISP, or a coffee shop wifi hot spot, or a mobile network then the network operator will dictate what DNS resolver to use.\n…\nThe problem is that these DNS services are often slow and not privacy respecting.</p>\n</blockquote>\n\n<p>Although I like Cloudflare, I’m not sure what to think regarding there recent news regarding their own <a href=\"https://blog.cloudflare.com/announcing-1111/\">DNS service</a>.</p>\n\n<p>I do think it’ great that they bring an alternative DNS service (with great performance and seemingly a strong focus on privacy). But I have some reservations regarding centralising DNS at a company which already controls 80% of the western internet.</p>\n",
			"date_published": "2018-04-02T21:49:00+02:00",
			"url": "http://roelwillems.com/2018/04/02/although-i-like.html"
		},
		
		{
			"id": "http://roelwillems.micro.blog/2017/11/20/a-list-aparts.html",
	      	
			"title": "A List Apart's 20th anniversary view on the centralising of the internet in to only a handful of all-powerful networks",
			
			"content_html": "<p>“In recent years, we’ve seen our rich universe of diverse, creative blogs and sites implode—leaving fewer and fewer channels available to new voices. As more content centralizes into a handful of all-powerful networks, there’s a dreary sameness in perspective and presentation. …. This creeping monopolization is a sad echo of how media worked in the 20th century. It doesn’t reflect 21st century diversity and empowerment. It’s not the web’s promise. It’s not how it’s supposed to be.”</p>\n\n<p><a href=\"https://alistapart.com/article/new-a-list-apart-wants-you\">A list apart</a></p>\n\n<p>I couldn’t agree more to this statement. With some centralized players growing more  powerfull with each day passing, it’s more important to support diversity, independent content creation and keep ownership of your content.</p>\n",
			"date_published": "2017-11-20T21:13:00+01:00",
			"url": "http://roelwillems.com/2017/11/20/a-list-aparts.html"
		}
		
	]
}
